ГТС/УТГТС/Documents/ASP_УчетВнутреннихВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ASP_УчетВнутреннихВзаиморасчетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Comment>Кому зачитываются доп.расходы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ASP_ВнутренниеПлательщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПлательщик</Name>
					<Comment>С кого списываются доп.расходы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ASP_ВнутренниеПлательщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУслуги</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаТранспорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВывоз</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииОтделаСервиса</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Положительная - расход подразделения плательщика, отрицательная - доход подразделения плательщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровереноПлательщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровереноПолучателем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Documents/ASP_УчетВнутреннихВзаиморасчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьОформление();
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРасхода) и Объект.Ссылка.Пустая() Тогда
		Объект.ДатаРасхода=ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПровереноПлательщикомПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПровереноПлательщикомПриИзменении(Элемент)
	УстановитьОформление();
	ПровереноПлательщикомПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровереноПолучателемПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПровереноПолучателемПриИзменении(Элемент)
	УстановитьОформление();
	ПровереноПолучателемПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПлательщикПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПлательщикПриИзменении(Элемент)
	УстановитьОформление();
	ПодразделениеПлательщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПолучательПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПолучательПриИзменении(Элемент)
	УстановитьОформление();
	ПодразделениеПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОформление()
	Если Объект.ПровереноПлательщиком=Истина Тогда
		Элементы.ПодразделениеПлательщик.Доступность=Ложь;
		Элементы.ДатаРасхода.Доступность=Ложь;
		Элементы.Сумма.Доступность=Ложь;
	ИначеЕсли Объект.ПровереноПлательщиком = ложь Тогда
	Элементы.ПодразделениеПлательщик.Доступность=Истина;
	Иначе Элементы.ПодразделениеПлательщик.Доступность=Ложь;
	КонецЕсли;
	Если Объект.ПровереноПолучателем=Истина Тогда
		Элементы.ПодразделениеПолучатель.Доступность=Ложь;
		Элементы.ДатаРасхода.Доступность=Ложь;
		Элементы.Сумма.Доступность=Ложь;
	ИначеЕсли Объект.ПровереноПолучателем = ложь Тогда
	Элементы.ПодразделениеПолучатель.Доступность=Истина;
	Иначе Элементы.ПодразделениеПолучатель.Доступность=Ложь;
	КонецЕсли;
	ЕСЛИ ПараметрыСеанса.ТекущийПользователь.Подразделение=ПолучитьРеальноеПодразделение(Объект.ПодразделениеПлательщик) Тогда
	Элементы.ПровереноПлательщиком.Доступность=Истина;
	Иначе Элементы.ПровереноПлательщиком.Доступность=Ложь;
	КонецЕсли;
	Если ПараметрыСеанса.ТекущийПользователь.Подразделение=ПолучитьРеальноеПодразделение(Объект.ПодразделениеПолучатель) Тогда
		Элементы.ПровереноПолучателем.Доступность=Истина;
	Иначе Элементы.ПровереноПолучателем.Доступность=Ложь; 
	КонецЕсли;

	КонецПроцедуры

&НаСервере
Функция ПолучитьРеальноеПодразделение(ВнутреннийПлательщик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_ВнутренниеПлательщики.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ASP_ВнутренниеПлательщики КАК ASP_ВнутренниеПлательщики
		|ГДЕ
		|	ASP_ВнутренниеПлательщики.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВнутреннийПлательщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Подразделение;
	КонецЦикла;
	

КонецФункции

&НаСервере
Функция ПолучитьВнутреннегоПлательщика (Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_ВнутренниеПлательщики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ASP_ВнутренниеПлательщики КАК ASP_ВнутренниеПлательщики
		|ГДЕ
		|	ASP_ВнутренниеПлательщики.Подразделение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	

КонецФункции
